Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.LowestAssociatedLevelAboveHighestAssociatedLevel Property
 The Lowest Associated Level is set above the Highest Associated Level
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LowestAssociatedLevelAboveHighestAssociatedLevel { get; }
Visual Basic
Public Shared ReadOnly Property LowestAssociatedLevelAboveHighestAssociatedLevel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LowestAssociatedLevelAboveHighestAssociatedLevel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace